Repository: boroda74/TagTools
Catalog: Additional-Tagging-Tools/AdvancedSearchAndReplace.*.resx
Languages: ru

# uncheckAllFiltersPictureBox.ToolTip
source: Remove all filters
ru: Отключить все фильтры

# hotkeyPictureBox.ToolTip
source: Click to show only presets with assigned hotkeys Ctrl+click to add/remove this filter to/from existing ones Presets must meet ALL checked filters SIMULTANEOUSLY
ru: Щелкните, чтобы видеть только пресеты с назначенными комбинациями клавиш Щелкните, удерживая клавишу Ctrl, чтобы добавить этот фильтр к существующим или отключить его Пресеты должны соответствовать ВСЕМ выбранным фильтрам ОДНОВРЕМЕННО

# functionIdPictureBox.ToolTip
source: Click to show only presets with assigned function ids Ctrl+click to add/remove this filter to/from existing ones Presets must meet ALL checked filters SIMULTANEOUSLY
ru: Щелкните, чтобы видеть только пресеты с назначенными ID-ми функций виртуальных тегов Щелкните, удерживая клавишу Ctrl, чтобы добавить этот фильтр к существующим или отключить его Пресеты должны соответствовать ВСЕМ выбранным фильтрам ОДНОВРЕМЕННО

# playlistPictureBox.ToolTip
source: Click to show only presets constrained by playlist Ctrl+click to add/remove this filter to/from existing ones Presets must meet ALL checked filters SIMULTANEOUSLY
ru: Щелкните, чтобы видеть только пресеты, ограниченные плейлистом Щелкните, удерживая клавишу Ctrl, чтобы добавить этот фильтр к существующим или отключить его Пресеты должны соответствовать ВСЕМ выбранным фильтрам ОДНОВРЕМЕННО

# userPictureBox.ToolTip
source: Click to show only user presets Ctrl+click to add/remove this filter to/from existing ones Presets must meet ALL checked filters SIMULTANEOUSLY
ru: Щелкните, чтобы видеть только пресеты пользователя Щелкните, удерживая клавишу Ctrl, чтобы добавить этот фильтр к существующим или отключить его Пресеты должны соответствовать ВСЕМ выбранным фильтрам ОДНОВРЕМЕННО

# customizedPictureBox.ToolTip
source: Click to show only customized presets Ctrl+click to add/remove this filter to/from existing ones Presets must meet ALL checked filters SIMULTANEOUSLY
ru: Щелкните, чтобы видеть только настроенные пресеты Щелкните, удерживая клавишу Ctrl, чтобы добавить этот фильтр к существующим или отключить его Пресеты должны соответствовать ВСЕМ выбранным фильтрам ОДНОВРЕМЕННО

# predefinedPictureBox.ToolTip
source: Click to show only predefined presets Ctrl+click to add/remove this filter to/from existing ones Presets must meet ALL checked filters SIMULTANEOUSLY
ru: Щелкните, чтобы видеть только стандартные пресеты Щелкните, удерживая клавишу Ctrl, чтобы добавить этот фильтр к существующим или отключить его Пресеты должны соответствовать ВСЕМ выбранным фильтрам ОДНОВРЕМЕННО

# tickedOnlyPictureBox.ToolTip
source: Click to show only auto-executed presets Ctrl+click to add/remove this filter to/from existing ones Presets must meet ALL checked filters SIMULTANEOUSLY
ru: Щелкните, чтобы видеть только автоприменяемые пресеты Щелкните, удерживая клавишу Ctrl, чтобы добавить этот фильтр к существующим или отключить его Пресеты должны соответствовать ВСЕМ выбранным фильтрам ОДНОВРЕМЕННО

# filterComboBox.Items
source: (No filter)
ru: (Без фильтра)

# filterComboBox.Items1
source: Auto-executed
ru: Автоматически применяемые

# filterComboBox.Items2
source: Predefined
ru: Стандартные

# filterComboBox.Items3
source: Customized
ru: Настроенные пользователем

# filterComboBox.Items4
source: User
ru: Пресеты пользователя

# filterComboBox.Items5
source: Constrained by playlist
ru: Ограниченные плейлистом

# filterComboBox.Items6
source: Function ID assigned
ru: С назначенными ID-ми функций

# filterComboBox.Items7
source: Hotkey assigned
ru: С назначенными комбинациями клавиш

# filterComboBox.ToolTip
source: Select one of preset filters Ctrl+click to add/remove this filter to/from existing ones Presets must meet ALL checked filters SIMULTANEOUSLY
ru: Выберите один из фильтров пресетов Щелкните с нажатой клавишей Ctrl, чтобы добавить фильтр к существующим или отключить его

# clearSearchButton.ToolTip
source: Clear search text
ru: Очистить текст поиска

# searchTextBox.ToolTip
source: Enter part of the preset name or just some words from the preset name to filter the list
ru: Введите часть имени пресета или просто несколько слов из имени пресета, чтобы отфильтровать список

# $this.Text
source: Advanced Search & Replace
ru: Дополнительный поиск и замена

# clearIdButton.ToolTip
source: Remove assignment of virtual tag function ID to preset
ru: Удалить назначение ID-а функции виртуальных тегов пресету

# idTextBox.ToolTip
source: Only ASCII letters, numbers and symbols - : _ . are allowed
ru: Разрешены только латинские буквы, цифры и символы - : _ .

# assignHotkeyCheckBox.ToolTip
source: First enable hotkey for one or several presets, then "save & close" this window, and assign hotkeys from MusicBee menu: Edit> Preferences> Hotkeys You will need to reassign hotkey if the preset name is changed
ru: Сначала включите комбинацию клавиш для одного или нескольких пресетов, потом сохраните изменения и откройте настройки горячих клавиш MusicBee: Правка> Настройки> Горячие клавиши Потребуется заново назначить комбинацию клавиш, если изменится название пресета

# groupBox1.Text
source: Preset description
ru: Описание пресета

# customText4Label.Text
source: <Custom text 4>
ru: <Свой текст 4>:

# customText2Label.Text
source: <Custom text 2>
ru: <Свой текст 2>:

# customText3Label.Text
source: <Custom text 3>
ru: <Свой текст 3>:

# labelTag6.Text
source: <Tag 6>
ru: <Тег 6>:

# labelTag5.Text
source: <Tag 5>
ru: <Тег 5>:

# labelTag4.Text
source: <Tag 4>
ru: <Тег 4>:

# customTextLabel.Text
source: <Custom text 1>
ru: <Свой текст 1>:

# labelTag3.Text
source: <Tag 3>
ru: <Тег 3>:

# labelTag2.Text
source: <Tag 2>
ru: <Тег 2>:

# labelTag.Text
source: <Tag 1>
ru: <Тег 1>:

# Track.HeaderText
source: Track
ru: Трек

# OriginalTag1.HeaderText
source: Orig. tag value
ru: Исходный тег 1

# NewTag1.HeaderText
source: New tag value
ru: Новое значение

# OriginalTag2.HeaderText
source: Orig. tag value
ru: Исходный тег 2

# NewTag2.HeaderText
source: New tag value
ru: Новое значение

# OriginalTag3.HeaderText
source: Orig. tag value
ru: Исходный тег 3

# NewTag3.HeaderText
source: New tag value
ru: Новое значение

# buttonSaveClose.Text
source: Save All && Close
ru: Сохранить и закрыть

# buttonOK.Text
source: Proceed
ru: Применить

# buttonPreview.Text
source: Preview
ru: Просмотр

# buttonClose.Text
source: Close
ru: Закрыть

# buttonClose.ToolTip
source: There are unsaved changes
ru: Есть несохраненные изменения

# buttonExport.Text
source: Export...
ru: Экспортировать...

# buttonExport.ToolTip
source: Export selected user or customized predefined preset to share it with other people
ru: Экспортировать выбранный пользовательский или настроенный стандартный пресет для обмена с другими людьми

# buttonDeleteAll.Text
source: Delete All
ru: Удалить все

# buttonDeleteAll.ToolTip
source: Delete all preinstalled presets
ru: Удалить все стандартные пресеты

# buttonDelete.Text
source: Delete
ru: Удалить

# buttonDelete.ToolTip
source: Delete selected preset
ru: Удалить выбранный пресет

# buttonEdit.Text
source: Rename / Edit
ru: Изменить

# buttonCreate.Text
source: Create
ru: Создать

# buttonImport.Text
source: Import...
ru: Импортировать...

# buttonImport.ToolTip
source: Import preset(s) previously exported by you or another user
ru: Импортировать пресет(ы), ранее экспортированный(ые) вами или другим человеком

# buttonImportNew.Text
source: Install New
ru: Установить новые

# buttonImportNew.ToolTip
source: (Re)install predefined presets, created or updated by developer since last time you installed/updated predefined presets If you have deleted some predefined presets, then they won't be reinstalled
ru: (Пере)установить стандартные пресеты, созданные или обновленные разработчиком с момента их последней установки/обновления Если вы удалили какие-то стандартные пресеты, то они не будут переустановлены

# buttonImportAll.Text
source: Install All
ru: Установить все

# buttonImportAll.ToolTip
source: Install all predefined presets, updating already installed predefined presets to the latest version If you have deleted some preinstalled presets, they will be reinstalled
ru: Установить все стандартные пресеты, обновив уже установленные стандартные пресеты до последней версии Если вы удалили какие-то стандартные пресеты, они будут переустановлены

# buttonExportCustom.Text
source: Export User...
ru: Экспортировать свои...

# buttonExportCustom.ToolTip
source: Export all user presets
ru: Экспортировать все пользовательские пресеты

# buttonCopy.Text
source: Copy
ru: Копировать

# buttonCopy.ToolTip
source: Copy selected preset to another user preset (you will be able to edit this copy)
ru: Скопировать выбранный пресет в новый пресет пользователя (новый пресет можно будет редактировать)
