Repository: boroda74/TagTools
Catalog: Additional-Tagging-Tools/AutoRate.*.resx
Languages: ru

# buttonOK.Text
source: Auto rate selected files
ru: Установить рейтинг выбранных файлов

# groupBox1Label.Text
source: Set how much of your library should get which rating
ru: Укажите какой процент библиотеки должен иметь определенный рейтинг

# buttonCalculate.Text
source: Calculate thresholds now
ru: Рассчитать пороговые значения

# labelTotalTracks.Text
source: Number of ever played tracks in your library:
ru: Ever played tracks in your library: 0

# groupBox2Label.Text
source: Set the thresholds of auto rating
ru: Пороговые значения для установки рейтингов

# label30.Text
source: Average plays per day
ru: В среднем воспроизведений в день

# label29.Text
source: Maximum plays per day
ru: Максимум воспроизведений в день

# label28.Text
source: plays per day or more
ru: или больше воспроизведений в день

# checkBox05Label.Text
source: Set half star if:
ru: Установить 0,5 звездочки, если:

# label27.Text
source: plays per day or more
ru: или больше воспроизведений в день

# checkBox1Label.Text
source: Set one star if:
ru: Установить 1 звездочку, если:

# label26.Text
source: plays per day or more
ru: или больше воспроизведений в день

# checkBox15Label.Text
source: Set one-to-two stars if:
ru: Установить 1,5 звездочки, если:

# label25.Text
source: plays per day or more
ru: или больше воспроизведений в день

# checkBox2Label.Text
source: Set two stars if:
ru: Установить 2 звездочки, если:

# label24.Text
source: plays per day or more
ru: или больше воспроизведений в день

# checkBox25Label.Text
source: Set two-to-three stars if:
ru: Установить 2,5 звездочки, если:

# label23.Text
source: plays per day or more
ru: или больше воспроизведений в день

# checkBox3Label.Text
source: Set three stars if:
ru: Установить 3 звездочки, если:

# label22.Text
source: plays per day or more
ru: или больше воспроизведений в день

# checkBox35Label.Text
source: Set three-to-four stars if:
ru: Установить 3,5 звездочки, если:

# label21.Text
source: plays per day or more
ru: или больше воспроизведений в день

# checkBox4Label.Text
source: Set four stars if:
ru: Установить 4 звездочки, если:

# label20.Text
source: plays per day or more
ru: или больше воспроизведений в день

# checkBox45Label.Text
source: Set four-to-five stars if:
ru: Установить 4,5 звездочки, если:

# LabelFive.Text
source: plays per day or more
ru: или больше воспроизведений в день

# checkBox5Label.Text
source: Set five stars if:
ru: Установить 5 звездочек, если:

# label19.Text
source: Standard rating for never played tracks:
ru: Стандартный рейтинг для файлов, которые ни разу не воспроизводились:

# sinceAddedCheckBoxLabel.Text
source: Calculate "Plays per days in library" instead of "Plays per day"
ru: Рассчитывать "число воспроизведений в день во время существования в библиотеке" вместо "числа воспроизведений в день"

# sinceAddedCheckBoxLabel.ToolTip
source: Usually "Plays per day" means the average number of times you played track since it was added to the library and till the day it was last played. So if you played track frequently in past and didn't play it for a long time then it will have high "Plays per day" value. Sometimes it's better to use this option which will treat "Plays per day" as average number of times track was played since it was added to the library till today (no matter when it was last played). It's recommended to "Auto rate on startup" your tracks if you want to use this option because "Plays per days in library" value depends on "today" date which is dynamic value and auto rating should change every day for each track in this case.
ru: Обычно "Число воспроизведений в день" означает сколько раз в день в среднем композиция проигрывалась с момента добавления в библиотеку до момента последнего воспроизведения. Если вы воспроизводили композицию много раз в прошлом и с тех пор не слушали ее, то у нее будет высокое значение "Числа воспроизведений в день". Иногда лучше использовать эту опцию, чтобы трактовать "Число воспроизведений в день" как среднее чило вопроизведений в день с момента довления в библиотеку до текущего момента (не важно, когда композиция была поледний раз проиграна). Рекомендуется "автоматически устанавливать рейтинги при запуске", если вы хотите использовать эту опцию потому, что "число воспроизведений в день во время существования в библиотеке" меняется каждый день и установка авто-рейтингов должна происходить каждый день для каждой композиции.

# sinceAddedCheckBox.ToolTip
source: Usually "Plays per day" means the average number of times you played track since it was added to the library and till the day it was last played. So if you played track frequently in past and didn't play it for a long time then it will have high "Plays per day" value. Sometimes it's better to use this option which will treat "Plays per day" as average number of times track was played since it was added to the library till today (no matter when it was last played). It's recommended to "Auto rate on startup" your tracks if you want to use this option because "Plays per days in library" value depends on "today" date which is dynamic value and auto rating should change every day for each track in this case.
ru: Обычно "Число воспроизведений в день" означает сколько раз в день в среднем композиция проигрывалась с момента добавления в библиотеку до момента последнего воспроизведения. Если вы воспроизводили композицию много раз в прошлом и с тех пор не слушали ее, то у нее будет высокое значение "Числа воспроизведений в день". Иногда лучше использовать эту опцию, чтобы трактовать "Число воспроизведений в день" как среднее чило вопроизведений в день с момента довления в библиотеку до текущего момента (не важно, когда композиция была поледний раз проиграна). Рекомендуется "автоматически устанавливать рейтинги при запуске", если вы хотите использовать эту опцию потому, что "число воспроизведений в день во время существования в библиотеке" меняется каждый день и установка авто-рейтингов должна происходить каждый день для каждой композиции.

# autoRateOnTrackPropertiesCheckBoxLabel.Text
source: Auto rate songs automatically if they are played
ru: Автоматически установить рейтинг при изменении проигрываемого трека

# notifyWhenAutoratingCompletedCheckBoxLabel.Text
source: Notify when auto rating is completed
ru: Оповестить по завершении

# autoRateAtStartUpCheckBoxLabel.Text
source: Auto rate on startup
ru: Автоматически установить рейтинги при запуске

# buttonSave.Text
source: Save settings
ru: Сохранить настройки

# storePlaysPerDayCheckBoxLabel.Text
source: Store number of plays per day in tag:
ru: Сохранять число воспроизведений в день в тег:

# holdsAtStartUpCheckBoxLabel.Text
source: Auto calculate thresholds on startup
ru: Автоматически рассчитывать пороговые значения при запуске

# label4.Text
source: Store auto rating in tag:
ru: Сохранять рейтинг в тег:

# $this.Text
source: Auto Rate Tracks
ru: Автоматически установить рейтинги

# buttonCancel.Text
source: Close
ru: Закрыть
