Repository: boroda74/TagTools
Catalog: Additional-Tagging-Tools/TagHistory.*.resx
Languages: ru

# buttonOK.Text
source: Proceed
ru: Применить

# buttonCancel.Text
source: Close
ru: Закрыть

# Library.HeaderText
source: Library
ru: Библиотека

# label3.Text
source: Search for backups in folder
ru: Искать архивы в папке:

# browseButton.Text
source: Browse...
ru: Открыть...

# forLastLabel.Text
source: for last
ru: среди последних

# backupsLabel.Text
source: backups
ru: архивов

# rereadButton.Text
source: Reread now
ru: Повторить поиск

# restoreSelectedButton.Text
source: Restore selected
ru: Восстановить

# restoreSelectedButton.ToolTip
source: Copy selected backup cells to library column
ru: Скопировать выделенные ячейки архивов в колонку библиотеки

# selectTagsButton.Text
source: Select tags...
ru: Выбрать теги...

# selectTagsButton.ToolTip
source: Select displayed tags
ru: Выбрать отображаемые теги

# rememberColumnasDefaulltWidthCheckBox.ToolTip
source: Tick this option and change the width of any column to set this width as new default
ru: Включите этот флажок и измените ширину любой колонки, чтобы установить эту новую ширину в качестве новой ширины по умолчанию

# undoButton.Text
source: Undo all changes
ru: Отменить все

# undoButton.ToolTip
source: Copy selected backup cells to library column
ru: Восстановить колонку библиотеки

# AutoSelectTagsCheckBox.ToolTip
source: Automatically select displayed tags and don't show backups, which have no differences with current tags
ru: Автоматически выбирать показываемые теги и скрывать архивы без отличий в тегах от текущих тегов

# rememberColumnasDefaulltWidthCheckBoxLabel.Text
source: Set changed column width as new default
ru: Установить измененную ширину колонки в качестве новой ширины по умолчанию

# rememberColumnasDefaulltWidthCheckBoxLabel.ToolTip
source: Tick this option and change the width of any column to set this width as new default
ru: Включите этот флажок и измените ширину любой колонки, чтобы установить эту новую ширину в качестве новой ширины по умолчанию

# label4.Text
source: Tag history for track
ru: Теги для трека:

# $this.Text
source: Tag History
ru: История тегов
