Repository: boroda74/TagTools
Catalog: Plugin/AutoBackupSettings.*.resx
Languages: ru

# buttonBrowse.Text
source: Browse...
ru: Просмотр...

# autoBackupFolderLabel.Text
source: Auto-backup folder
ru: Папка авто-резервирования:

# autoBackupPrefixLabel.Text
source: Prefix for auto-backup filenames:
ru: Префикс имен файлов для автоматически созданных архивов:

# autoBackupCheckBox.ToolTip
source: AutoBackups will be skipped if content of current library is not changed and no tags are changed after last manual or auto backup.
ru: Авто-архивирование будет пропущено, если содержание текущей библиотеки и какие-либо теги не изменились с момента последнего ручного или автоматического архивирования.

# autoBackupPeriodLabel.Text
source: mins.
ru: дней.

# autoDeleteOldCheckBox.ToolTip
source: Only auto-backups of current library will be deleted
ru: Только автоматические архивы текущей библиотеки будут удаляться

# autoDeleteManyCheckBox.ToolTip
source: Only auto-backups of current library will be deleted
ru: Только автоматические архивы текущей библиотеки будут удаляться

# autoDeleteOldLabel.Text
source: days.
ru: минут.

# buttonClose.Text
source: Cancel
ru: Отмена

# backupArtworksCheckBox.ToolTip
source: WARNING! Both manual & automatic backups depend on this option.
ru: ВНИМАНИЕ! Эта опция затрагивает, как ручное, так и автоматическое архивирование.

# dontTryToGuessLibraryNameCheckBox.ToolTip
source: WARNING! Both manual & automatic backups depend on this option. Sometimes guessing current library name may work incorrectly.
ru: ВНИМАНИЕ! Эта опция затрагивает, как ручное, так и автоматическое архивирование. Иногда предположение названия библиотеки работает некорректно.

# autoBackupCheckBoxLabel.Text
source: Auto-backup every
ru: Авто-архивация каждые:

# autoBackupCheckBoxLabel.ToolTip
source: AutoBackups will be skipped if content of current library is not changed and no tags are changed after last manual or auto backup.
ru: Авто-архивирование будет пропущено, если содержание текущей библиотеки и какие-либо теги не изменилсь с момента последнего ручного или автоматического архивирования.

# autoDeleteOldCheckBoxLabel.Text
source: Automatically delete backups older than
ru: Автоматически удалять архивы старше:

# autoDeleteOldCheckBoxLabel.ToolTip
source: Only auto-backups of current library will be deleted
ru: Только автоматические архивы текущей библиотеки будут удаляться

# autoDeleteManyCheckBoxLabel.Text
source: Automatically delete old backups if the total number of backups exceeds
ru: Автоматически удалять старые архивы, если общее архивов число больше, чем:

# autoDeleteManyCheckBoxLabel.ToolTip
source: Only auto-backups of current library will be deleted
ru: Только автоматические архивы текущей библиотеки будут удаляться

# dontTryToGuessLibraryNameCheckBoxLabel.Text
source: Don't try to guess current library name
ru: Не пытаться предполагать название библиотеки

# dontTryToGuessLibraryNameCheckBoxLabel.ToolTip
source: WARNING! Both manual & automatic backups depend on this option. Sometimes guessing current library name may work incorrectly.
ru: ВНИМАНИЕ! Эта опция затрагивает, как ручное, так и автоматическое архивирование. Иногда предположение названия библиотеки работает некорректно.

# backupArtworksCheckBoxLabel.Text
source: Backup album artworks (not recommended)
ru: Архивировать обложки альбомов (не рекомендуется)

# backupArtworksCheckBoxLabel.ToolTip
source: WARNING! Both manual & automatic backups depend on this option.
ru: ВНИМАНИЕ! Эта опция затрагивает, как ручное, так и автоматическое архивирование.

# storeTrackIdsInCustomTagCheckBoxLabel.Text
source: Use custom tag to store track IDs
ru: Использовать свой тег для хранения идентификаторов треков

# storeTrackIdsInCustomTagCheckBoxLabel.ToolTip
source: Backup/restore relies on MusicBee internal track IDs specific to the library. Because of this, you can't restore tags to a library other than the library from which the tags have been backed up. If you tick this option, the plugin will save a copy of the track IDs to a custom tag of your choice and will restore backed-up tags using this custom tag to identify tracks instead of actual track IDs. This will let you restore the tags to the new library containing the same tracks, if you have recreated the library from scratch, e.g., on another computer. Make sure that this custom tag is stored in the file tag, not in the MusicBee database.
ru: Архивация/восстановление тегов основано на внутренних идентификаторах треков MusicBee, зависящих от библиотеки. По этой причине вы не можете восстановить теги в библиотеку, отличную от той, из которой были созданы резервные копии тегов. Если вы отметите эту опцию, плагин сохранит копию идентификаторов треков в выбранном вами своем теге и будет восстанавливать резервные копии тегов, используя этот тег для идентификации треков вместо фактических идентификаторов треков. Это позволит вам восстановить теги в новую библиотеку, содержащую те же треки, если вы воссоздавали библиотеку заново, например, на другом компьютере. Убедитесь, что этот свой тег хранится в теге файла, а не в базе данных MusicBee.

# storeTrackIdsInCustomTagCheckBox.ToolTip
source: Backup/restore relies on MusicBee internal track IDs specific to the library. Because of this, you can't restore tags to a library other than the library from which the tags have been backed up. If you tick this option, the plugin will save a copy of the track IDs to a custom tag of your choice and will restore backed-up tags using this custom tag to identify tracks instead of actual track IDs. This will let you restore the tags to the new library containing the same tracks, if you have recreated the library from scratch, e.g., on another computer. Make sure that this custom tag is stored in the file tag, not in the MusicBee database.
ru: Архивация/восстановление тегов основано на внутренних идентификаторах треков MusicBee, зависящих от библиотеки. По этой причине вы не можете восстановить теги в библиотеку, отличную от той, из которой были созданы резервные копии тегов. Если вы отметите эту опцию, плагин сохранит копию идентификаторов треков в выбранном вами своем теге и будет восстанавливать резервные копии тегов, используя этот тег для идентификации треков вместо фактических идентификаторов треков. Это позволит вам восстановить теги в новую библиотеку, содержащую те же треки, если вы воссоздавали библиотеку заново, например, на другом компьютере. Убедитесь, что этот свой тег хранится в теге файла, а не в базе данных MusicBee.

# trackIdTagList.ToolTip
source: Backup/restore relies on MusicBee internal track IDs specific to the library. Because of this, you can't restore tags to a library other than the library from which the tags have been backed up. If you tick this option, the plugin will save a copy of the track IDs to a custom tag of your choice and will restore backed-up tags using this custom tag to identify tracks instead of actual track IDs. This will let you restore the tags to the new library containing the same tracks, if you have recreated the library from scratch, e.g., on another computer. Make sure that this custom tag is stored in the file tag, not in the MusicBee database.
ru: Архивация/восстановление тегов основано на внутренних идентификаторах треков MusicBee, зависящих от библиотеки. По этой причине вы не можете восстановить теги в библиотеку, отличную от той, из которой были созданы резервные копии тегов. Если вы отметите эту опцию, плагин сохранит копию идентификаторов треков в выбранном вами своем теге и будет восстанавливать резервные копии тегов, используя этот тег для идентификации треков вместо фактических идентификаторов треков. Это позволит вам восстановить теги в новую библиотеку, содержащую те же треки, если вы воссоздавали библиотеку заново, например, на другом компьютере. Убедитесь, что этот свой тег хранится в теге файла, а не в базе данных MusicBee.

# dontSkipAutoBackupsIfPlayCountsChangedLabel.Text
source: Don't skip auto-backup, even if only play/skip counts are changed
ru: Не пропускать авто-архивирование, даже если изменились только счетчики проигрываний/пропусков

# $this.Text
source: (Auto)backup Settings
ru: Настройки (авто)архивации
