Repository: boroda74/TagTools
Catalog: Plugin/CustomSortingForColumnBrowser.*.resx
Languages: ru

# $this.Text
source: Custom Sorting for Column Browser
ru: Своя сортировка для браузера колонок

# autoCopyCheckBox.ToolTip
source: Auto-copy on the real tag change, preserving sorted position in column browser (create the rule for this pair of tags)
ru: Автоматически копировать при изменении реального тега, сохраняя позицию сортировки в браузере колонок (создать правило для этой пары тегов)

# autoCopyCheckBoxLabel.Text
source: Auto-copy on the real tag change
ru: Авто-копировать реальный тег при изменении

# autoCopyCheckBoxLabel.ToolTip
source: Auto-copy on the real tag change, preserving sorted position in column browser (create the rule for this pair of tags)
ru: Автоматически копировать при изменении реального тега, сохраняя позицию сортировки в браузере колонок (создать правило для этой пары тегов)

# buttonClose.Text
source: Close
ru: Закрыть

# buttonCopy.Text
source: Copy
ru: Копировать

# buttonCopyLabel.Text
source: Copy the real tag to custom tag:
ru: Скопировать реальный тег в свой тег:

# buttonLoad.Text
source: Load
ru: Считать

# buttonLoad.ToolTip
source: Load current left tag sorting
ru: Считать текущую сортировку левого тега

# buttonOK.Text
source: Save
ru: Сохранить

# buttonOK.ToolTip
source: Update current sorting
ru: Обновить текущую сортировку

# buttonOverwrite.Text
source: Overwrite
ru: Записать

# buttonOverwrite.ToolTip
source: Overwrite left tag, ignoring current values
ru: Перезаписать левый тег, игнорируя текущие значения

# infoLabel.Text
source: Custom sorting is done by inserting invisible zero-width spaces at the beginning of tags. Tags won't be changed visually, but their real values WILL be changed. So it's recommended to use custom tag copies of real tags for custom sorting.
ru: Своя сортировка осуществляется путем вставки невидимых пробелов нулевой ширины в начало тегов. Теги не будут изменены визуально, но их реальные значения БУДУТ изменены. Поэтому для своей сортировки рекомендуется использовать копии реальных тегов, сохраненные в свои теги.
