Repository: boroda74/TagTools
Catalog: Plugin/LibraryReports.*.resx
Languages: ru

# buttonPreview.Text
source: Preview
ru: Просмотр

# buttonPreview.ToolTip
source: Preview report for DISPLAYED tracks
ru: Сформировать отчет для ОТОБРАЖАЕМЫХ треков

# buttonClose.Text
source: Close
ru: Закрыть

# buttonClose.ToolTip
source: There are unsaved changes
ru: Есть не сохраненные изменения

# autoApplyPresetsLabel.Text
source: Export tags to file for use in 3d party applications. Table is sorted by grouping tags from left to right when "Preview" button is clicked. Ticked presets are auto-executed on MusicBee startup. ~Presets ticked for auto-execution: %%TICKED-PRESETS%%~Auto-execution of presets is disabled in plugin settings.
ru: Экспорт тегов в файл для использования в сторонних приложениях. Таблица сортируется по группирующим тегам слева направо после нажатия кнопки "Просмотр". Отмеченные пресеты автоматически применятются при запуске MusicBee. ~Отмечено для автоматического применения: %%TICKED-PRESETS%%~Автоматическое применение пресетов отключено в настройках плагина.

# $this.Text
source: Library Reports
ru: Отчеты по библиотеке

# hidePreviewCheckBoxLabel.Text
source: Hide preview
ru: Скрыть предпросмотр

# hidePreviewCheckBoxLabel.ToolTip
source: Use this option for very large reports to avoid "Out of memory" exceptions This option also significantly speeds up report generation The report will be generated but will not be displayed You will be able to export the generated report to a file as usual
ru: Используйте эту опцию для очень больших отчетов, чтобы избежать исключений «Недостаточно памяти» Также эта опция значительно ускоряет вычисление отчета Отчет будет создан, но не будет отображен Вы сможете экспортировать созданный отчет в файл как обычно

# hidePreviewCheckBox.ToolTip
source: Use this option for very large reports to avoid "Out of memory" exceptions This option also significantly speeds up report generation The report will be generated but will not be displayed You will be able to export the generated report to a file as usual
ru: Используйте эту опцию для очень больших отчетов, чтобы избежать исключений «Недостаточно памяти» Также эта опция значительно ускоряет вычисление отчета Отчет будет создан, но не будет отображен Вы сможете экспортировать созданный отчет в файл как обычно

# smartOperationCheckBoxLabel.Text
source: Smart multiple artists/composers
ru: Умные теги "Исполнитель"/"Композитор"

# smartOperationCheckBoxLabel.ToolTip
source: Replace <Null> service character, which separates the multiple values of "Artist" and "Composer" tags, by "; " character sequence. Unchecking this may only be relevant in the case of using multiple item splitter
ru: Заменять служебный символ <Null>, который разделяет несколько значений тегов "Исполнитель" и "Композитор", последовательностью символов "; ". Отключение этой опции может быть актуально только в случае использования разделителя элементов

# smartOperationCheckBox.ToolTip
source: Replace <Null> service character, which separates the multiple values of "Artist" and "Composer" tags, by "; " character sequence. Unchecking this may only be relevant in the case of using multiple item splitter
ru: Заменять служебный символ <Null>, который разделяет несколько значений тегов "Исполнитель" и "Композитор", последовательностью символов "; ". Отключение этой опции может быть актуально только в случае использования разделителя элементов

# appendLabel.Text
source: Append text at the end (e.g. "M"):
ru: Добавить в конце

# appendLabel.ToolTip
source: Append text at the end of number, but before text postfix of number (if any), e.g. "M" for "MB" (Megabyte)
ru: Добавить текст в конце числа, но перед текстом после числа (если он есть), например, "М" для обозначения "МБ" (Мегабайт)

# digitsLabel.Text
source: digit(s)
ru: цифр(ы)

# precisionDigitsComboBox.Items
source: (don't round)
ru: (не округлять)

# precisionDigitsComboBox.Text
source: (don't round)
ru: (не округлять)

# roundToLabel.Text
source: round to
ru: округлить до

# mulDivFactorComboBox.Items
source: 1 (ignore)
ru: 1 (игнорировать)

# mulDivFactorComboBox.Text
source: 1 (ignore)
ru: 1 (игнорировать)

# operationComboBox.Items
source: Divide by
ru: Разделить на

# operationComboBox.Items1
source: Multiply by
ru: Умножить на

# clearIdButton.ToolTip
source: Remove assignment of virtual tag function ID to aggregated function
ru: Удалить назначение ID-а функции виртуальных тегов агрегатной функции

# idTextBox.ToolTip
source: Only ASCII letters, numbers and symbols - : _ . are allowed
ru: Разрешены только буквы ASCII, числа и символы - : _ .!

# labelFunctionId.Text
source: Assign virtual tag function ID
ru: Назначить ID функции вирт. тегов

# labelSaveToTag.Text
source: to tag
ru: в тег

# labelSaveField.Text
source: Save field
ru: Сохранить поле

# buttonFilterResults.Text
source: Filter
ru: Отфильтровать

# buttonFilterResults.ToolTip
source: Filter the preview according to the condition on the left
ru: Отфильтровать предварительный просмотр в соответствии с условием слева

# conditionCheckBoxLabel.Text
source: Export/save all tags only if tag
ru: Экспортировать/сохранять только, если тег

# buttonExport.Text
source: Export
ru: Экспортировать

# openReportCheckBoxLabel.Text
source: open with default application
ru: открыть в приложении по умолчанию

# openReportCheckBoxLabel.ToolTip
source: Save exported report to Windows temporary directory and open it in default application, e.g. for printing
ru: При экспортировании сохранить отчет во временном каталоге Windows и открыть его в приложении по умолчанию, например, для печати

# openReportCheckBox.ToolTip
source: Save exported report to Windows temporary directory and open it in default application, e.g. for printing
ru: При экспортировании сохранить отчет во временном каталоге Windows и открыть его в приложении по умолчанию, например, для печати

# labelRemark.Text
source: px keeping image aspect ratio
ru: пкс, сохраняя пропорции

# resizeArtworkCheckBoxLabel.Text
source: Resize artwork long side to:
ru: Изменить бо́льшую сторону обложек на

# totalsCheckBoxLabel.Text
source: Calculate subgrouping totals
ru: Вычислять итоги по подгруппировкам

# formatComboBox.ToolTip
source: Format of exported report
ru: Формат экспортируемого отчета

# labelFormat.Text
source: Format
ru: Формат

# useAnotherPresetAsSourceComboBox.ToolTip
source: Select preset, which uses conditional filtering Retrieved presets can be chained
ru: Выберите пресет, использующий фильтрацию по условию Пресеты для получения списка треков могут быть организованы в цепочку

# useAnotherPresetAsSourceCheckBoxLabel.Text
source: Retrieve tracks from another preset
ru: Получить список треков из другого пресета

# useAnotherPresetAsSourceCheckBox.ToolTip
source: Retrieving tracks from another preset makes sense only if this preset is using conditional filtering Retrieved presets can be chained: The retrieved preset or other retrieved presets in the chain are not selected or no longer use conditional filtering, which means the retrieval ​chain is useless!: The selected preset or other presets in the chain either have been deleted or are now included in the looped preset chain!: This preset can't be used! Check out the preset chain!
ru: Получение списка треков из другого пресета имеет смысл только, если этот пресет использует фильтрацию по условию. Пресеты для получения списка треков могут быть организованы в цепочку: Пресет для получения списка треков, или другие пресеты в цепочке, не выбраны, или больше не используют фильтрацию по условию, а значит, цепочка пресетов бесполезна!: Выбранный пресет, или другие пресеты в цепочке, либо были удалены, либо теперь включены в зацикленную цепочку пресетов!: Сейчас этот пресет не может быть использован! Проверьте цепочку пресетов!

# buttonSaveClose.Text
source: Save All && Close
ru: Сохранить и закрыть

# buttonSaveClose.ToolTip
source: Save all new/changed preset definitions and close this window Ctrl-click to save preset definitions without closing this window
ru: Сохранить все новые/измененные определения пресетов и закрыть это окно Щелкните мышкой с нажатой клавишей Ctrl, чтобы сохранить определения пресетов без закрытия этого окна

# buttonOK.Text
source: Proceed
ru: Применить

# buttonOK.ToolTip
source: Execute preset for SELECTED tracks
ru: Применить пресет к ВЫБРАННЫМ трекам

# buttonSettings.ToolTip
source: Open quick settings
ru: Открыть быстрые настройки

# buttonDeletePreset.Text
source: Delete Preset
ru: Удалить пресет

# buttonCopyPreset.Text
source: Copy Preset
ru: Копировать пресет

# buttonAddPreset.Text
source: New Preset
ru: Новый пресет

# useHotkeyForSelectedTracksCheckBoxLabel.Text
source: Execute for seleted tracks
ru: Применять к выбранным трекам

# useHotkeyForSelectedTracksCheckBoxLabel.ToolTip
source: Assign hotkey to execute preset for selected tracks only, or to entire library if this option is unchecked
ru: Назначить комбинацию клавиш для применения к выделенным трекам, или в противном случае, ко всей библиотеке

# useHotkeyForSelectedTracksCheckBox.ToolTip
source: Assign hotkey to execute preset for selected tracks only, or to entire library if this option is unchecked
ru: Назначить комбинацию клавиш для применения к выделенным трекам, или в противном случае, ко всей библиотеке

# assignHotkeyCheckBoxLabel.Text
source: Assign hotkey for this preset. Left: 20/20
ru: Назначить комбинацию клавиш. Осталось: 20/20

# assignHotkeyCheckBoxLabel.ToolTip
source: First enable hotkeys for one or several presets, save presets, then this window, and go to Edit> Preferences> Hotkeys You will need to reassign hotkey if the preset name is changed
ru: Сначала включите комбинацию клавиш для одного или нескольких пресетов, потом закройте это окно и откройте настройки горячих клавиш MusicBee: Правка> Настройки> Горячие клавиши Потребуется заново назначить комбинацию клавиш, если изменится название пресета

# assignHotkeyCheckBox.ToolTip
source: First enable hotkeys for one or several presets, save presets, then this window, and go to Edit> Preferences> Hotkeys You will need to reassign hotkey if the preset name is changed
ru: Сначала включите комбинацию клавиш для одного или нескольких пресетов, потом закройте это окно и откройте настройки горячих клавиш MusicBee: Правка> Настройки> Горячие клавиши Потребуется заново назначить комбинацию клавиш, если изменится название пресета

# presetNameTextBox.ToolTip
source: Type preset name (otherwise, it will be automatically generated)
ru: Введите название пресета (в противном случае оно будет сформировано автоматически)

# tabPage1.Text
source: Preview
ru: Просмотр

# tagsDataGridViewCheckedColumn.ToolTipText
source: Uncheck to remove grouping/function from the preset
ru: Снимите отметку, чтобы удалить группировку/функцию из пресета

# tagsDataGridViewFunctionColumn.HeaderText
source: Function
ru: Функция

# tagsDataGridViewFunctionColumn.ToolTipText
source: The field:\\%%FIELD-NAME%%\\already exists. Do you want to replace the field?
ru: Поле:\\%%FIELD-NAME%%\\уже существует. Вы хотите заменить это поле?

# tagsDataGridViewTagColumn.HeaderText
source: Tag
ru: Тег

# tagsDataGridViewInfoColumn.HeaderText
source: Info
ru: Инфо

# tagsDataGridViewInfoColumn.ToolTipText
source: Multiple item splitter for groupings, or "per tag" tag for functions
ru: Разделитель элементов для группировок или тег, относительно которого считается среднее, для функций

# tagsDataGridView.ToolTip
source: The order of the columns in the report corresponds to the order in which they were added, but this table is sorted alphabetically to simplify navigation. Don’t be confused. See the real column order in the preview table.
ru: Порядок колонок в отчете соответствует порядку, в котором они были добавлены, но эта таблица отсортирована в алфавитном порядке для упрощения навигации. Не перепутайте. Смотрите реальный порядок колонок в таблице предварительного просмотра.

# expressionsDataGridViewCheckedColumn.ToolTipText
source: Uncheck to remove expression column from the preset
ru: Снимите отметку, чтобы удалить колонку выражения из пресета

# expressionsDataGridViewExpressionColumn.HeaderText
source: Expression
ru: Выражение

# expressionsDataGridViewExpressionColumn.ToolTipText
source: You have unchecked the last expression for the field:\\%%FIELD-NAME%%\\Do you want to delete the field?
ru: Вы сняли отметку с последнего выражения для поля:\\%%FIELD-NAME%%\\Вы хотите удалить это поле?

# expressionTextBox.Text
source: (No expression)
ru: (Без выражения)

# expressionLabel.Text
source: Virtual tag expression:
ru: Выражение виртуального тега

# expressionLabel.ToolTip
source: Enter any expression valid for virtual tag The expression is calculated after splitting items for groupings and before calculating aggregated functions
ru: Введите любое выражение, допустимое для виртуального тега, или выберите существующее Выражение вычисляется после разбиения группировок на элементы и перед вычислением агрегатных функций

# parameter2Label.Text
source: per tag
ru: на тег

# forTagLabel.Text
source: of tag
ru: тега

# labelFunction.Text
source: Function
ru: Функция

# buttonUpdateFunction.Text
source: Save:Update
ru: Сохранить : Обновить

# buttonUpdateFunction.ToolTip
source: Save new column definition:Update column definition
ru: Сохранить определение новой колонки:Обновить определение колонки

# multipleItemsSplitterTrimCheckBoxLabel.Text
source: Trim whitespaces
ru: Удалять непечатные символы

# buttonAddFunction.Text
source: Add:Discard
ru: Добавить:Отказаться

# buttonAddFunction.ToolTip
source: Add new column definition:Discard changes
ru: Добавить определение новой колонки:Отказаться от изменений

# multipleItemsSplitterTrimCheckBox.ToolTip
source: Remove all leading and trailing white-space characters from the split tag value
ru: Удалять все начальные и конечные непечатные символы (например, пробелы) из разделенных элементов

# buttonHelp.Text
source: Help
ru: Справка

# buttonHelp.ToolTip
source: Help on using virtual function expressions LR expressions are mostly intended to be used for regexes, though they are not limited to them. Expressions can save you virtual tags if you need some expressions to be used in LR only, but the main purpose of LR expressions is to use them together with multiple item splitters for grouping tags. If several virtual tags sourced from a single tag are split into multiple values (e.g., separated by ; ) for a given track, then all combinations of these values will be included in the LR report. Contrary to this, different expressions of one split grouping tag for a given track produce a single combination for every split tag value. You can refer to any tag in an LR expression using the MusicBee generic <Tag Name> construction, or refer to the current grouping/function tag (which can already be one of the split tag values if splitter is defined for this tag) as \@
ru: Справка по использованию выражений виртуальных функций Выражения ОБ в основном предназначены для использования с регулярными выражениями, хотя они этим не ограничиваются. Выражения могут сэкономить вам виртуальные теги, если вам нужно, чтобы некоторые выражения использовались только в ОБ, но основная цель выражений ОБ — использовать их вместе с разделителями элементов для тегов группировок. Если несколько виртуальных тегов, полученных из одного тега, разделены на несколько значений (например, разделенных ; ) для данного трека, то все комбинации этих значений будут включены в отчет ОБ. В отличие от этого, различные выражения одного разделенного тега для данной дорожки создают единую комбинацию для каждого разделенного значения тега. Вы можете ссылаться на любой тег в выражении ОБ, используя общую конструкцию MusicBee <Название тега>, или ссылаться на текущий тег группировки/функции (который уже может быть одним из разделенных значениий тега, если разделитель для этого тега задан) как \@

# multipleItemsSplitterComboBox.Items
source: (don't use)
ru: (не использовать)

# multipleItemsSplitterComboBox.Items1
source: \0 (e.g. for multiple artists per "Artist" tag)
ru: \0 (например, для нескольких исполнителей в теге "Исполнитель")

# multipleItemsSplitterComboBox.Items2
source: ; (e.g. for multiple genres per "Genre" tag)
ru: ; (например, для нескольких жанров в теге "Жанр")

# multipleItemsSplitterComboBox.ToolTip
source: Split grouping tag values by the specified separator
ru: Разбивать значения тега группировки по указанному разделителю

# multipleItemsSplitterLabel.Text
source: Multiple item splitter:
ru: Разделитель элементов:

# multipleItemsSplitterLabel.ToolTip
source: Split grouping tag values by the specified separator
ru: Разбивать значения тега группировки по указанному разделителю

# buttonClearExpression.ToolTip
source: Clear expression
ru: Очистить выражение

# tabPage2.Text
source: Column definitions
ru: Определения колонок
