Repository: boroda74/TagTools
Catalog: Plugin/Settings.*.resx
Languages: ru

# label6.Text
source: Configure additional tagging tools
ru: Настройки дополнительных инструментов (при изменении некоторых настроек потребуется перезапуск MusicBee)

# versionLabel.Text
source: Version:
ru: Версия:

# playTickedAsrPresetSoundCheckBoxLabel.Text
source: Play sound on ticking ASR/LR preset for auto-execution
ru: Проиграть звук при отметке пресета ДПЗ/ОБ для автоматического применения

# playStoppedSoundCheckBoxLabel.Text
source: Play system "Stop" sound when background task is canceled
ru: Проиграть системный звук "Стоп", когда фоновая задача отменена пользователем

# playStartedSoundCheckBoxLabel.Text
source: Play system "Exclamation" sound when background task is started
ru: Проиграть системный звук "Восклицание", когда фоновая задача начинается

# playCompletedSoundCheckBoxLabel.Text
source: Play system "Asterisk" sound when background task is completed/stopped
ru: Проиграть системный звук "Звездочка", когда фоновая задача завершается/остановлена

# label9.Text
source: Sounds
ru: Звуки

# label4.Text
source: Unit of billions (e.g. "G" for "Giga"):
ru: Единица измерения миллиардов (например, "Г" для "Гига"):

# label3.Text
source: Unit of millions (e.g. "M" for "Mega"):
ru: Единица измерения миллионов (например, "М" для "Мега"):

# label2.Text
source: Unit of thousands (e.g. "K" for "Kilo"):
ru: Единица измерения тысяч (например, "К" для "Кило"):

# label11.Text
source: "Library Reports" command (not required for English Windows localization, case-insensitive)
ru: Команда "Отчеты по библиотеке" (не нужно для русской и английской локализации Windows, регистр не важен)

# saveLastSkippedButton.Text
source: Save last skipped date...
ru: Сохранять дату последнего пропуска трека...

# preservedTagValuesLegendTextBox.Text
source: Preserved tag values
ru: Пропущенные значения тегов

# preservedTagsLegendTextBox.Text
source: Preserved tags
ru: Пропущенные теги

# changedLegendTextBox.Text
source: Changed
ru: Измененные

# changedLegendTextBox.ToolTip
source: Click on any example field to see the colors of selected line:Click on any example field to see the colors of not selected line
ru: Щелкните мышкой по любому полю, чтобы увидеть цвета выделенной строки:Щелкните мышкой по любому полю, чтобы увидеть цвета невыделенной строки

# legendLabel.Text
source: Legend
ru: Цвета предварительного просмотра

# highlightChangedTagsCheckBoxLabel.Text
source: Highlight changed tags
ru: Подсвечивать измененные теги

# showHiddenCommandWindowsRadioButtonLabel.Text
source: Show hidden plugin window when related task is completed/terminated
ru: Показывать скрытое окно плагина, когда его фоновая задача завершена/прервана

# closeHiddenCommandWindowsRadioButtonLabel.Text
source: Close hidden plugin window when related task is completed/terminated
ru: Закрывать скрытое окно плагина, когда его фоновая задача завершена/прервана

# minimizePluginWindowsCheckBoxLabel.Text
source: Minimize plugin windows instead of hiding them
ru: Минимизировать окна плагина, вместо того чтобы скрывать их

# useCustomFontCheckBoxLabel.Text
source: Use custom font **
ru: Использовать свой шрифт **

# useMusicBeeFontCheckBoxLabel.Text
source: Use MusicBee font **
ru: Использовать шрифт MusicBee **

# useSkinColorsCheckBoxLabel.Text
source: Use skin colors **
ru: Использовать цвета темы **

# label8.Text
source: Appearance
ru: Оформление

# contextMenuCheckBoxLabel.Text
source: Show commands in context menu
ru: Показывать команды в контекстном меню

# allowCommandExecutionWithoutPreviewCheckBoxLabel.Text
source: Allow command execution without generating preview *
ru: Разрешить выполнение команд без предварительного просмотра изменений *

# allowAsrLrPresetAutoExecutionCheckBoxLabel.Text
source: Allow ASR/LR presets auto-execution
ru: Разрешить автоматическое применение пресетов ДПЗ/ОБ

# showShowHiddenWindowsCheckBoxLabel.Text
source: Show "Show hidden/restore minimized plugin windows" menu item
ru: Показывать в меню пункт "Показать скрытые/восстановить свернутые окна плагина"

# showBackupRestoreCheckBoxLabel.Text
source: Enable "Backup && Restore" commands
ru: Включить команды архивации и восстановления

# showCTCheckBoxLabel.Text
source: Enable "Compare Tracks" command
ru: Включить команду "Сравнить треки"

# showCARCheckBoxLabel.Text
source: Enable "Calculate Average Album Ratings" command
ru: Включить команду "Рассчитать средний рейтинг альбомов"

# showAsrCheckBoxLabel.Text
source: Enable "Advanced Search && Replace" / "Multiple Search && Replace" commands
ru: Включить команды "Дополнительные поиск и замена" / "Множественный поиск и замена"

# showAutoRateCheckBoxLabel.Text
source: Enable "Auto Rate" command
ru: Включить команду "Автоматически установить рейтинги"

# showLibraryReportsCheckBoxLabel.Text
source: Enable "Library Reports" command
ru: Включить команду "Отчеты по библиотеке"

# showReEncodeTagCheckBoxLabel.Text
source: Enable "Reencode Tag(s)" commands
ru: Включить команду "Изменить кодировку тега"

# showChangeCaseCheckBoxLabel.Text
source: Enable "Change Case" command
ru: Включить команду "Изменить регистр тега"

# showSwapTagsCheckBoxLabel.Text
source: Enable "Swap Tags" command
ru: Включить команду "Поменять местами два тега"

# showCopyTagCheckBoxLabel.Text
source: Enable "Copy Tag" command
ru: Включить команду "Копировать тег"

# label7.Text
source: Select commands
ru: Выберите команды

# includePreservedTagValuesCheckBoxLabel.Text
source: Include in preview lines containing preserved tag values only (Advanced Search && Replace)
ru: Включать в предварительный просмотр строки, содержащие только игнорированные значения тегов (Дополнительный поиск и замена)

# includePreservedTagsCheckBoxLabel.Text
source: Include in preview lines containing preserved tags only (Advanced Search && Replace)
ru: Включать в предварительный просмотр строки, содержащие только игнорированные теги (Дополнительный поиск и замена)

# includeNotChangedTagsCheckBoxLabel.Text
source: Include in preview lines not containing changed tags (All commands)
ru: Включать в предварительный просмотр строки, не содержащие измененные теги (все команды)

# label10.Text
source: Result filtering
ru: Фильтрация результатов

# label1.Text
source: * MusicBee restart is required for the changed settings to take effect
ru: * Требуется перезапуск MusicBee, чтобы новые настройки вступили в силу

# label5.Text
source: ** Plugin windows reopening is required for the changed settings to take effect
ru: ** Требуется заново открыть окна плагина, чтобы новые настройки вступили в силу

# tabPage1.Text
source: Behaviour
ru: Поведение

# tabPage2.Text
source: Processing
ru: Обработка

# $this.Text
source: Settings
ru: Настройки
